## Reading and Writing Data in Text Format

In [3]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(12345)

In [5]:
import matplotlib.pyplot as plt

In [6]:
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [7]:
# cat=type for windows, cat is unix based command
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [8]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [11]:
pd.read_csv('ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [12]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [13]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
!type csv_mindex.csv
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])
parsed

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [15]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [16]:
result = pd.read_table('ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [17]:
!type ex4.csv
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [19]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [21]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
sentinels = {'a': ['5', 'NA'], 'b': ['2'], 'something': ['three']}
pd.read_csv('ex5.csv', na_values=sentinels)

  something    a     b     c   d message
0       one  1.0   NaN   3.0   4     NaN
1       two  NaN   6.0   NaN   8   world
2       NaN  9.0  10.0  11.0  12     foo

## Reading Text Files in Pieces

In [23]:
pd.options.display.max_rows = 10

In [24]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)
chunker

In [27]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

tot = pd.Series([], dtype='float64')
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [28]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to Text Format

In [29]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
data.to_csv('out.csv')

In [31]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [32]:
import sys

In [33]:
data.to_csv(sys.stdout, na_rep='|')

,something,a,b,c,d,message
0,one,1,2,3.0,4,|
1,two,5,6,|,8,world
2,three,9,10,11.0,12,foo

In [34]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [35]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [36]:
dates = pd.date_range('1/1/2000', periods=7)

In [37]:
ts = pd.Series(np.arange(7), index=dates)

In [38]:
ts.to_csv('tseries.csv')

In [39]:
!type tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

## Working with Delimited Formats

In [40]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [41]:
import csv
f = open('ex7.csv')
reader = csv.reader(f)

In [42]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [43]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [44]:
header, values = lines[0], lines[1:]

In [45]:
data_dict = {header: values for header, values in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [46]:
with open('ex7.csv') as f:
    class my_dialect(csv.Dialect):
        lineterminator = '\n'
        delimiter = ';'
        quotechar = '"'
        quoting = csv.QUOTE_MINIMAL
    reader = csv.reader(f, dialect=my_dialect)
    reader = csv.reader(f, delimiter='|')
    print(reader)

<_csv.reader object at 0x00000243C253DE80>

In [47]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))
!type mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

## JSON Data

In [48]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [49]:
import json

In [50]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [51]:
asjson = json.dumps(result)

In [52]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [53]:
!type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [54]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [55]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [56]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [57]:
tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [58]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

## Parsing XML with lxml.objectify

In [59]:
from lxml import objectify

In [60]:
parsed = objectify.parse(open('Performance_MNR.xml'))
root = parsed.getroot()

In [61]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [62]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [63]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [64]:
root

In [65]:
root.get('href')

'http://www.google.com'

In [66]:
root.text

'Google'

## Binary Data Formats

In [67]:
frame = pd.read_csv('ex1.csv')
frame
frame.to_pickle('frame_pickle')

In [68]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [69]:
!type frame_pickle

â‚¬â€¢Â¥      Å’pandas.core.frameâ€Å’	DataFrameâ€â€œâ€)ï¿½â€}â€(Å’_mgrâ€Å’pandas.core.internals.managersâ€Å’BlockManagerâ€â€œâ€Å’	functoolsâ€Å’partialâ€â€œâ€Å’pandas.core.internals.blocksâ€Å’	new_blockâ€â€œâ€â€¦â€Râ€(h)}â€Å’ndimâ€KsNtâ€bÅ’numpy.core.numericâ€Å’_frombufferâ€â€œâ€(â€“`                     	                     
                                                â€Å’numpyâ€Å’dtypeâ€â€œâ€Å’i8â€â€°Ë†â€¡â€Râ€(KÅ’<â€NNNJÃ¿Ã¿Ã¿Ã¿JÃ¿Ã¿Ã¿Ã¿K tâ€bKKâ€ â€Å’Câ€tâ€Râ€builtinsâ€Å’sliceâ€â€œâ€K KKâ€¡â€Râ€â€ â€Râ€hhâ€¦â€Râ€(h)}â€hKsNtâ€bÅ’numpy.core.multiarrayâ€Å’_reconstructâ€â€œâ€hÅ’ndarrayâ€â€œâ€K â€¦â€Cbâ€â€¡â€Râ€(KKKâ€ â€hÅ’O8â€â€°Ë†â€¡â€Râ€(KÅ’|â€NNNJÃ¿Ã¿Ã¿Ã¿JÃ¿Ã¿Ã¿Ã¿K?tâ€bâ€°]â€(Å’helloâ€Å’worldâ€Å’fooâ€etâ€bh&KKKâ€¡â€Râ€â€ â€Râ€â€ â€]â€(Å’pandas.core.indexes.baseâ€Å’
_new_Indexâ€â€œâ€hIÅ’Indexâ€â€œâ€}â€(Å’dataâ€h1h3K â€¦â€h5â€¡â€Râ€(KKâ€¦â€h;â€°]â€(Å’aâ€Å’bâ€Å’câ€Å’dâ€Å’messageâ€etâ€bÅ’nameâ€Nuâ€ â€Râ€hKÅ’pandas.core.indexes.rangeâ€Å’
RangeIndexâ€â€œâ€}â€(h[NÅ’startâ€K Å’stopâ€KÅ’stepâ€Kuâ€ â€Râ€eâ€ â€Râ€Å’_typâ€Å’	dataframeâ€Å’	_metadataâ€]â€Å’attrsâ€}â€Å’_flagsâ€}â€Å’allows_duplicate_labelsâ€Ë†sub.

## Using HDF5 Format

In [70]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [71]:
store['obj1']

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [72]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [73]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781

In [74]:
import os
os.remove('mydata.h5')

## Reading Microsoft Excel Files

In [75]:
xlsx = pd.ExcelFile('ex1.xlsx')

In [76]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [77]:
frame = pd.read_excel('ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [78]:
writer = pd.ExcelWriter('ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [79]:
frame.to_excel('ex2.xlsx')

In [80]:
# rm = del for windows to remove file
!del ex2.xlsx

C:\Users\yashu\Desktop\fds practs\Assingments\a5\ex2.xlsx

The process cannot access the file because it is being used by another process.

## Interacting with Web-Databases

In [81]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [82]:
data = resp.json()
data[0]['title']

'tests with fixture for dtypes added'

In [83]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,44836,tests with fixture for dtypes added,[],open
1,44835,BUG: Int64 index_col raises AttributeError: 'B...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,44834,CI: Pin numpydev wheels,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
3,44833,ENH: Add a parameter in rolling() to control t...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
4,44832,PERF: array_equivalent_object,[],open
...,...,...,...,...
25,44796,PERF: DataFrame.__setitem__,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
26,44794,ENH: Initial implementation of support for SQL...,[],open
27,44793,"ENH: support np.add.reduce, np.multiply.reduce",[],open
28,44792,BUG: MultiIndex constructed with nulls inconsi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,44791,PERF: avoid calling .values to know the result...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open

## Interacting with Databases

In [84]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

OperationalError: table test already exists

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [ ]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

In [ ]:
!del mydata.sqlite